app/controllers/api/restaurants_controller.rb

    def show
        @bench = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]