app/views/api/restaurants/show.json.jbuilder

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = $1  [["restaurant_id", 4]]
---
json.set! :menu do
    @restaurant.menu_items.each do |item|