app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0mQsQh9cxbJYpz_70n5H4A"], ["updated_at", "2022-08-14 02:19:50.612879"], ["id", 1]]
---
  def reset_session_token!
    # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
    self.session_token = SecureRandom.urlsafe_base64
    self.save